app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["name", "I am from Sony. Thanks for joining us!"], ["created_at", "2020-05-19 09:43:00.573609"], ["updated_at", "2020-05-19 09:43:00.573609"]]
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save

UPDATE "tweets" SET "user_id" = $1, "name" = $2, "updated_at" = $3 WHERE "tweets"."id" = $4  [["user_id", 6], ["name", "I am pretty much interested in learning new thing1s."], ["updated_at", "2020-05-20 06:40:53.216863"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_tweet
      @tweet = Tweet.find(params[:id])