app/models/user.rb

INSERT INTO "permissions" ("user_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["role_id", 2], ["created_at", "2020-05-19 09:06:18.143256"], ["updated_at", "2020-05-19 09:06:18.143256"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["name", "non_admin"], ["LIMIT", 1]]
---
  def set_permissions
  	self.permissions.create!(user_id: self.id, role_id: Role.where(name: "non_admin").first.id)

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["name", "admin"], ["LIMIT", 1]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."user_id" = $1  [["user_id", 1]]
---
  def role?(role_name)
  	self.permissions.map{|p| p.role_id}.include? Role.where(name: role_name).first.id