app/views/users/registrations/new.html.erb

SELECT "organizations".* FROM "organizations"
---
    <%= f.label :Organization %><br />
    <%= f.collection_select :organization_id, Organization.all, :id, :name %>